       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       AUTHOR. BJORN BLOMBERG.
       DATE-WRITTEN. 2023-JUN-30.

       PROCEDURE DIVISION.
           DISPLAY "Hej världen".
           STOP RUN.
